title: Ransomware Note
id: e62a9f01-ca1e-46b2-85d5-a6da77f86d16
status: test
description: Ransomware README note identified
references:
    - attack.data_encrypted_for_impact
    - attack.t1486
author: Riordz
date: 2024-09-06
tags:
    - ransomware
logsource:
    category: file_event
    product: windows
detection:
    selection_filename:
        FileName|contains:
          - 'Readme'
          - 'read'
    selection_file_extension:
        - FileName|endswith:
        - '.txt'
        - '.htm'
        - '.html'
    condition: 1 of selection_filename and 1 of selection_file_*
falsepositives:
    - Legitimate Software may rarely include readme files for usage
level: high