title: SocGholish - Execution of Javascript from Windows Scripting Host
id: e62a9f01-ca1e-46b2-85d5-a6da77f86d15
status: experimental
description: SocGholish - JavaScript Execution
references:
    - https://attack.mitre.org/software/S1124/
author: Riordz
date: 2024-09-03
tags:
    - attack.command-and-scripting-interpreter
    - software.s1124
logsource:
    category: process_creation
    product: windows
detection:
    selection_process:
        OriginalFileName:
          - 'wscript.exe'
          - 'cscript.exe'
    selection_cmdline:
        CommandLine|contains:
          - 'update.js'
    condition: 1 of selection_process and selection_cmdline
falsepositives:
    - unknown
level: high
